app/views/viagems/_form.html.erb

SELECT "rots".* FROM "rots"
---
          <%= f.label "Rota" %><br>
          <%= f.collection_select :rot_id, Rot.all, :id, :nome, :prompt => "Select One", class: "form-control" %>

SELECT "veiculos".* FROM "veiculos"
---
          <%= f.label :veiculo %><br>
          <%= f.collection_select :veiculo_id, Veiculo.all, :id, :marca, :prompt => "Select One", class: "form-control" %>