app/views/dashboard/index.html.erb

			   	<%= label_tag :veiculo %><br>
			   	<%= collection_select :veiculo, :veiculo_id, Veiculo.all, :id, :marca, {prompt: "Select One"}, {class: "form-control"} %>
---
SELECT "veiculos".* FROM "veiculos"

			   	<%= label_tag :viagem %><br>
			   	<%= collection_select :viagem, :viagem_id, Viagem.all, :id, :nome, {prompt: "Select One"}, {class: "form-control"}  %>
---
SELECT "viagems".* FROM "viagems"