app/views/ponto_passagems/_form.html.erb

SELECT "rots".* FROM "rots"
---
    <%= f.label :rot %><br>
    <%= f.collection_select :rot_id, Rot.all, :id, :nome, :prompt => "Select One" %>

SELECT "pontos".* FROM "pontos"
---
    <%= f.label :ponto %><br>
    <%= f.collection_select :ponto_id, Ponto.all, :id, :nome, :prompt => "Select One" %>