app/views/rots/_form.html.erb

          <%= f.label :origem %><br>
          <%= f.collection_select :origem_id, Ponto.all, :id, :nome, :prompt => "Select One", class: "form-control" %>
---
SELECT "pontos".* FROM "pontos"