app/controllers/itinerario_realizados_controller.rb

SELECT "itinerario_realizados".* FROM "itinerario_realizados"
---
  def index
    @itinerario_realizados = ItinerarioRealizado.all

INSERT INTO "itinerario_realizados" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Thu, 08 May 2014 00:21:20 UTC +00:00], ["updated_at", Thu, 08 May 2014 00:21:20 UTC +00:00]]
---
  def create
    @itinerario_realizado = ItinerarioRealizado.new(itinerario_realizado_params)

    respond_to do |format|
      if @itinerario_realizado.save

DELETE FROM "itinerario_realizados" WHERE "itinerario_realizados"."id" = ?  [["id", 1]]
---
  def destroy
    @itinerario_realizado.destroy

SELECT "itinerario_realizados".* FROM "itinerario_realizados" WHERE "itinerario_realizados"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_itinerario_realizado
      @itinerario_realizado = ItinerarioRealizado.find(params[:id])