app/controllers/ponto_passagems_controller.rb

SELECT "ponto_passagems".* FROM "ponto_passagems"
---
  def index
    @ponto_passagems = PontoPassagem.all

INSERT INTO "ponto_passagems" ("created_at", "ponto_id", "rota_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Mon, 05 May 2014 17:22:22 UTC +00:00], ["ponto_id", 1], ["rota_id", 1], ["updated_at", Mon, 05 May 2014 17:22:22 UTC +00:00]]
---
  def create
    @ponto_passagem = PontoPassagem.new(ponto_passagem_params)

    respond_to do |format|
      if @ponto_passagem.save

DELETE FROM "ponto_passagems" WHERE "ponto_passagems"."id" = ?  [["id", 1]]
---
  def destroy
    @ponto_passagem.destroy

SELECT "ponto_passagems".* FROM "ponto_passagems" WHERE "ponto_passagems"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_ponto_passagem
      @ponto_passagem = PontoPassagem.find(params[:id])