app/controllers/pontos_controller.rb

SELECT "pontos".* FROM "pontos"
---
  def index
    @pontos = Ponto.all

INSERT INTO "pontos" ("created_at", "nome", "updated_at") VALUES (?, ?, ?)  [["created_at", Mon, 05 May 2014 16:49:29 UTC +00:00], ["nome", "florianopolis, sc"], ["updated_at", Mon, 05 May 2014 16:49:29 UTC +00:00]]
---
  def create
    @ponto = Ponto.new(ponto_params)

    respond_to do |format|
      if @ponto.save

SELECT "pontos".* FROM "pontos" WHERE "pontos"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_ponto
      @ponto = Ponto.find(params[:id])