app/controllers/rots_controller.rb

SELECT "rots".* FROM "rots"
---
  def index
    @rots = Rot.all

INSERT INTO "rots" ("created_at", "destino_id", "nome", "origem_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 05 May 2014 18:57:42 UTC +00:00], ["destino_id", 1], ["nome", "R1"], ["origem_id", 2], ["updated_at", Mon, 05 May 2014 18:57:42 UTC +00:00]]
---
  def create
    @rot = Rot.new(rot_params)

    respond_to do |format|
      if @rot.save

UPDATE "rots" SET "origem" = $1, "destino" = $2, "updated_at" = $3 WHERE "rots"."id" = 10  [["origem", "torres, rs"], ["destino", "lages, sc"], ["updated_at", Fri, 30 May 2014 01:59:56 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @rot.update(rot_params)

DELETE FROM "rots" WHERE "rots"."id" = ?  [["id", 1]]
---
  def destroy
    @rot.destroy

SELECT "rots".* FROM "rots" WHERE "rots"."id" = ? LIMIT 1  [["id", "2"]]
---
    def set_rot
      @rot = Rot.find(params[:id])