app/controllers/veiculos_controller.rb

SELECT "veiculos".* FROM "veiculos" WHERE "veiculos"."id" = ? ORDER BY "veiculos"."id" ASC LIMIT 1  [["id", 1]]
SELECT "viagems".* FROM "viagems" WHERE "viagems"."veiculo_id" = ?  [["veiculo_id", 1]]
---
  def viagens
    @viagem = Veiculo.find(params[:id]).viagems

SELECT "veiculos".* FROM "veiculos"
---
  def index
    @veiculos = Veiculo.all

INSERT INTO "veiculos" ("created_at", "marca", "placa", "tipo", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 05 May 2014 15:54:01 UTC +00:00], ["marca", "V1"], ["placa", "V1"], ["tipo", "V1"], ["updated_at", Mon, 05 May 2014 15:54:01 UTC +00:00]]
---
  def create
    @veiculo = Veiculo.new(veiculo_params)

    respond_to do |format|
      if @veiculo.save

UPDATE "veiculos" SET "marca" = ?, "placa" = ?, "tipo" = ?, "updated_at" = ? WHERE "veiculos"."id" = 1  [["marca", "Ford"], ["placa", "ASD-1234"], ["tipo", "Furgão"], ["updated_at", Thu, 29 May 2014 02:30:16 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @veiculo.update(veiculo_params)

SELECT "veiculos".* FROM "veiculos" WHERE "veiculos"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_veiculo
      @veiculo = Veiculo.find(params[:id])