app/controllers/viagems_controller.rb

SELECT "itinerario_realizados".* FROM "itinerario_realizados" WHERE "itinerario_realizados"."viagem_id" = ?  [["viagem_id", 1]]
SELECT "viagems".* FROM "viagems" WHERE "viagems"."id" = ? LIMIT 1  [["id", "1"]]
---
  def itinerario_realizados
    @itinerario_realizados = Viagem.find(params[:id]).itinerario_realizados

SELECT "viagems".* FROM "viagems"
---
  def index
    @viagems = Viagem.all

INSERT INTO "viagems" ("created_at", "date", "rot_id", "updated_at", "veiculo_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 05 May 2014 19:07:59 UTC +00:00], ["date", Sat, 10 Feb 2024 00:00:00 UTC +00:00], ["rot_id", 1], ["updated_at", Mon, 05 May 2014 19:07:59 UTC +00:00], ["veiculo_id", 1]]
---
  def create
    @viagem = Viagem.new(viagem_params)

    respond_to do |format|
      if @viagem.save

UPDATE "viagems" SET "rot_id" = ?, "updated_at" = ? WHERE "viagems"."id" = 22  [["rot_id", 4], ["updated_at", Thu, 29 May 2014 02:20:11 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @viagem.update(viagem_params)

DELETE FROM "viagems" WHERE "viagems"."id" = ?  [["id", 5]]
---
  def destroy
    @viagem.destroy

SELECT "viagems".* FROM "viagems" WHERE "viagems"."id" = ? LIMIT 1  [["id", "22"]]
---
    def set_viagem
      @viagem = Viagem.find(params[:id])