app/views/map/viagem.html.erb

   <%= label_tag :veiculo %><br>
   <%= collection_select :veiculo, :veiculo_id, Veiculo.all, :id, :marca %>
---
SELECT "veiculos".* FROM "veiculos"